Testcases/SoapLibrary/XML/GeneratedRequest.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <intA>-100</intA>
            <intB>2147483648</intB>
        </Add>
    </Body>
</Envelope>